Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/tax_codes_and_civil_partnership.html.txt.tmx
Source language: en
Languages: ga

source: Tax codes and civil partnership
ga: Cóid chánach agus páirtnéireacht shibhialta

source: • Civil partnerships and tax
ga: • Páirtnéireachtaí sibhialta agus cáin

source: Civil partnerships and tax
ga: Páirtnéireachtaí sibhialta agus cáin

source: The tax provisions that apply to married couples are available to civil partners
ga: Tá fáil anois ar na forálacha cánach a bhaineann le lanúineacha pósta ag páirtnéirí sibhialta

source: Since 16 November 2015, no new civil partnerships can be registered unless the couple have notified the registrar of their intention to enter a civil partnership before that date
ga: Ar chlárú páirtnéireachta sibhialta, caithfear le páirtnéirí sibhialta ar an gcuma chéanna le céilí faoi na cóid chánach agus leasa shóisialaigh

source: More information is available in our document: Civil partnership and same-sex couples
ga: 3), 2011. Ritheadh an tAcht an 27 Iúil 2011 ach baineann na hathruithe le bliain mheasúnaithe 2011

source: Civil partners are entitled to the same rights as married couples in financial matters such as inheritance, property, pensions and maintenance if the relationship breaks down
ga: Ciallaíonn na hathruithe cánach a thug an tAcht isteach go bhfuil páirtnéirí sibhialta i dteideal na gcearta céanna atá lanúineacha pósta ina dteideal i gcúrsaí airgeadais, ar nós oidhreachta, réadmhaoine, pinsean agus cothabhála má chliseann an caidreamh

source: Your civil partnership does not have to be registered in Ireland
ga: Ní gá do pháirtnéireacht shibhialta bheith cláraithe in Éirinn

source: Some legal relationships between same sex couples that are recognised by a foreign state (such as marriage, civil union, civil partnership) are recognised by the Minister for Justice and Equality
ga: Aithníonn an tAire Dlí agus Cirt roinnt caidrimh dhlíthiúla idir lanúineacha den inscne chéanna a aithníonn stát iasachta (ar nós pósta, cumann sibhialta, páirtnéireacht shibhialta)

source: Any partnerships on the Minister’s list are recognised by Revenue for taxation purposes
ga: Aithníonn na Coimisinéirí Ioncaim aon pháirtnéireachtaí ar liosta an Aire ar mhaithe le cuspóirí cánach

source: You can find out more about how people in a civil partnership are taxed in our document Taxation of married people and civil partners
ga: Is féidir leat teacht ar thuilleadh faisnéise faoi conas a ghearrtar cáin ar dhaoine i bpáirtnéireacht shibhialta inár ndoiciméad Cánachas ar Dhaoine Pósta nó Páirtnéirí Sibhialta agus ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: If your civil partnership breaks down and is dissolved, protection orders, maintenance orders and pension adjustment orders may be made in the course of court proceedings for the dissolution of civil partnerships in the same way as such orders may be made in judicial separation and divorce proceedings
ga: Má chliseann ar do pháirtnéireacht shibhialta agus má dhíscaoiltear í, d’fhéadfaí orduithe cosanta, orduithe cothabhála agus coigeartaithe pinsin a dhéanamh i gcúrsa imeachtaí cúirte do dhíscaoileadh páirtnéireachtaí sibhialta ar an gcuma chéanna is féidir na horduithe sin a dhéanamh maidir le scaradh breithiúnach agus in imeachtaí colscartha

source: Currently only payments made under maintenance agreements ordered by a Court are allowable as a deduction against your income tax liability
ga: Faoi láthair, níl ach íocaíochtaí a rinneadh faoi chomhaontuithe cothabhála a d’ordaigh Cúirt incheadaithe mar asbhaint i leith do dhliteanais cáin ioncaim

source: Maintenance payments made to children are not deductable
ga: Níl íocaíochtaí cothabhála a rinneadh le leanaí in-asbhainte

source: You can find out more about the tax implications of different maintenance arrangements
ga: Is féidir leat teacht ar thuilleadh faisnéise faoi impleachtaí cánach socruithe éagsúla cothabhála anseo

source: The Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 gives protection to a financially dependent person at the end of a long-term cohabiting relationship
ga: Tugann an tAcht um Páirtnéireacht Shibialta agus um Chearta agus Oibleagáidí Áirithe, 2010, cosaint do dhuine atá spleách i dtaobh cúrsaí airgeadais de ag deireadh caidreamh fadtéarmach comháitithe

source: It also gives a cohabiting partner rights over a deceased person’s estate
ga: Ina theannta sin, bronnann an tAcht cearta páirtnéara thar mhaoin duine mhairbh

source: However the Act does not give any cohabiting couples the same tax treatment as married couples or civil partners
ga: Ní thugann an tAcht d’aon lanúineacha comháitithe an déileáil chéanna cánach, áfach, atá ag lanúineacha pósta nó ag páirtnéirí sibhialta

source: The only income tax provision for cohabiting couples is tax relief for court-ordered maintenance payments made to a financially dependant former cohabitant on the ending of a long-term cohabiting relationship
ga: Is é t-aon fhoráil chánach do lanúineacha comháitithe faoiseamh cánach d’íocaíochtaí cothabhála a d’ordaigh cúirt a dhéantar le hiar-chomháititheoir atá spleách i dtaobh cúrsaí airgeadais de ar chliseadh caidreamh fadtéarmach comháitithe

source: It is important to note that to qualify for tax relief the maintenance order must have been determined by the court rather than being an informal arrangement between the former cohabitants
ga: Is tábhachtach a thabhairt faoi deara, d'fhonn cáiliú d'fhaoiseamh cánach, nár mhór don ordú cothabhála bheith arna dheimhniú ag an gcúirt seachas bheith ina shocrú neamhfhoirmiúil idir na hiar-chomháititheoirí

source: In addition if a former cohabitant is granted redress by the courts through the transfer of an asset, this transaction is not liable to stamp duty or capital acquisitions tax and the donor of the property does not have a capital gains tax liability
ga: Sa mhullach air sin, má cheadaítear sásamh ar iar-chomháititheoir trí aistriú sócmhainne, ní bheidh an idirbheartaíocht seo anois dlite do dhleacht stampála ná do cháin fáltas caipitiúil agus níl ag deontóir na réadmhaoine dliteanas cánach um ghnóthachain chaipitiúla

source: Previously the former cohabiting couple would have been deemed unconnected and subject to full acquisitions tax, stamp duty and capital gains tax
ga: Roimhe seo, mheastaí gur dhínasctha don lanúin chomháitithe agus bheidís faoi réir cáin iomlán fáltas, dleacht stampála agus cáin fáltas caipitiúil

source: You can read more about the rights of cohabitants in Revenue’s FAQ document
ga: Is féidir leat níos mó a léamh faoi chearta comháititheoirí i ndoiciméad Cheisteanna Coitianta na gCoimisinéirí Ioncaim
